BAS BMEKZU Project/src/Catalogs/НоменклатураГТД/НоменклатураГТД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураГТД</name>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.БиологическиеАктивы</owners>
  <attributes>
    <name>КодУКТВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторУКТВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

BAS BMEKZU Project/src/Catalogs/НоменклатураГТД/Forms/ФормаЭлемента/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Изменение данных реквизитов приводит к обновлению наименования извне 
	ЗакешироватьСохраненныеРеквизиты(ЭтаФорма);
	
	// Если объект модифицирован пользователем, и пришло оповещение о том что 
	// наименование обновлено извне, то перечитаем объект чтобы не попасть на 
	// оптимистическую блокировку
	ЗакешироватьРедактируемыеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохраняем ссылки хранимые в БД на случай изменения извне
	ЗакешироватьСохраненныеРеквизиты(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Не Объект.Ссылка.Пустая() 
	   И ((ИмяСобытия = "Запись_КодУКТВЭД" И Ссылка_КодУКТВЭД = Источник) ИЛИ
	      (ИмяСобытия = "Запись_НомерГТД" И Ссылка_НомерГТД = Источник)) Тогда
	  
	 	ПеречитатьОбъектСервер();
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура КодУКТВЭДПриИзменении(Элемент)
	
	ЗакешироватьРедактируемыеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерГТДПриИзменении(Элемент)
	
	ЗакешироватьРедактируемыеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	ЗакешироватьРедактируемыеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПеречитатьОбъектСервер()
	
	ЗначениеВРеквизитФормы(Объект.Ссылка.ПолучитьОбъект(), "Объект");
	
	Если Модифицированность Тогда
		Объект.КодУКТВЭД   = Объект_КодУКТВЭД;
		Объект.НомерГТД    = Объект_НомерГТД;
		Объект.Комментарий = Объект_Комментарий;
	Иначе
		ЗакешироватьРедактируемыеРеквизиты(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗакешироватьРедактируемыеРеквизиты(Форма)
	
	// Номенклатуру не кешируем, доступна только для нового элемента 
	Форма.Объект_КодУКТВЭД   = Форма.Объект.КодУКТВЭД;
	Форма.Объект_НомерГТД    = Форма.Объект.НомерГТД;
	Форма.Объект_Комментарий = Форма.Объект.Комментарий;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗакешироватьСохраненныеРеквизиты(Форма)
	
	// Номенклатуру не кешируем, доступна только для нового элемента 
	Форма.Ссылка_КодУКТВЭД = Форма.Объект.КодУКТВЭД;
	Форма.Ссылка_НомерГТД  = Форма.Объект.НомерГТД;
	
КонецПроцедуры
